---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ParameterFailures.InconsistentSharedParameterDefinitions
source: html/9cff73ca-9155-602a-5604-9486399448aa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ParameterFailures.InconsistentSharedParameterDefinitions Property

The shared parameter '...' cannot be added with name '...' and type '...' because it conflicts with the existing name '...' and type '...'.

## Syntax (C#)
```csharp
public static FailureDefinitionId InconsistentSharedParameterDefinitions { get; }
```